const users = require('./users');

// reduce, чтобы собрать из массива пользователей объект
// acc - будущий объект с группами (начинаем с пустого {}).
// user — это текущий пользователь, первый.
const grouped = users.reduce((acc, user) => {
  
  // 1. Проверка есть ли уже в объекте acc ключ с названием города (user.city)
  // типо если user.city === 'Minsk', то проверяем, есть ли свойство acc['Minsk'].
  if (!acc[user.city]) {
    // Если такого города нет, мы создаем его и кладем туда пустой массив.
    acc[user.city] = [];
  }
  
  // добавляем (push) текущего пользователя в конец этого массива.
  acc[user.city].push(user);
  
  // 3. Возвращаем объект acc, чтобы на следующем шаге он стал юыл для следующего пользователя.
  return acc;
  
}, {}); // Начинаем с пустого объекта {}

// Выводим результат
console.log(grouped);